dattatraybhairi/Envoirnmental_Sensors_with_CC2510/CC2510_LIS2DE12_TEMPEN_SLF_TST_TH_AIRFLW_V8/code/michelin_tag/bme280.c
static int8_t stream_sensor_data_forced_mode(struct bme280_dev *dev);

static int8_t stream_sensor_data_normal_mode(struct bme280_dev *dev);

static void print_sensor_data(struct bme280_data *comp_data);

static int8_t user_spi_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len);

static int8_t user_spi_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len);

static void user_delay_ms(uint32_t period);


void BME280()
{
  /* Structure initialisation */
  //struct bme280_dev dev;
  int8_t rslt = BME280_OK;
  
  /* Sensor_0 interface over SPI with native chip select line */
  dev.dev_id = 0;
  dev.intf = BME280_SPI_INTF;
  dev.read = user_spi_read;
  dev.write = user_spi_write;
  dev.delay_ms = user_delay_ms;
  
  /* SPI init.*/
  spi_init();
  
  /* BME280 init. */
  rslt = bme280_init(&dev);
}
/****************** Global Function Definitions *******************************/

int8_t user_spi_read(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
{
  int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
  uint8_t i = 0;   /* Read counter */
  
  reg_addr = reg_addr | 0x80;
  SS_BME = 0;
  //while(MISO);
  *(reg_data) = spi_write(reg_addr);
  for(i=0; i<len; i++)
  {
    *(reg_data + i) = spi_write(0x00);
  }
  SS_BME = 1;
  
  return rslt;
}

int8_t user_spi_write(uint8_t dev_id, uint8_t reg_addr, uint8_t *reg_data, uint16_t len)
{
  int8_t rslt = 0; /* Return 0 for Success, non-zero for failure */
  uint8_t temp = 0; 
  
  SS_BME = 0;
  //while(MISO);
  temp = spi_write(reg_addr);
  temp = spi_write(*(reg_data));
  SS_BME = 1;
  
  return rslt;
}


void user_delay_ms(uint32_t period)
{
  /*
  * Return control or wait,
  * for a period amount of milliseconds
  */
  startTimer3();
  curmillis = millis;
  while(millis - curmillis < period);
  stopTimer3();
}

void BME280_measurement()
{
  int8_t rslt = BME280_OK;
  rslt = stream_sensor_data_forced_mode(&dev);
}

//Forced mode data streaming.
int8_t stream_sensor_data_forced_mode(struct bme280_dev *dev)
{
    int8_t rslt;
    uint8_t settings_sel;
    struct bme280_data comp_data;

    /* Recommended mode of operation: Indoor navigation */
    dev->settings.osr_h = BME280_OVERSAMPLING_1X;
    dev->settings.osr_p = BME280_NO_OVERSAMPLING;
    dev->settings.osr_t = BME280_OVERSAMPLING_1X;
    dev->settings.filter = BME280_FILTER_COEFF_OFF;

    settings_sel = BME280_OSR_PRESS_SEL | BME280_OSR_TEMP_SEL | BME280_OSR_HUM_SEL | BME280_FILTER_SEL;

    rslt = bme280_set_sensor_settings(settings_sel, dev);

    //printf("Temperature, Pressure, Humidity\r\n");
    /* Continuously stream sensor data */
    //while (1) 
    {
        rslt = bme280_set_sensor_mode(BME280_FORCED_MODE, dev);
        /* Wait for the measurement to complete and print data @25Hz */
        dev->delay_ms(40);
        rslt = bme280_get_sensor_data(BME280_ALL, &comp_data, dev);
        print_sensor_data(&comp_data);
    }
    return rslt;
}

//Normal mode data streaming.
int8_t stream_sensor_data_normal_mode(struct bme280_dev *dev)
{
	int8_t rslt;
	uint8_t settings_sel;
	struct bme280_data comp_data;

	/* Recommended mode of operation: Indoor navigation */
	dev->settings.osr_h = BME280_OVERSAMPLING_1X;
	dev->settings.osr_p = BME280_OVERSAMPLING_16X;
	dev->settings.osr_t = BME280_OVERSAMPLING_2X;
	dev->settings.filter = BME280_FILTER_COEFF_16;
	dev->settings.standby_time = BME280_STANDBY_TIME_62_5_MS;
        
        printf("%d\n",dev->settings.osr_h);

	settings_sel = BME280_OSR_PRESS_SEL;
	settings_sel |= BME280_OSR_TEMP_SEL;
	settings_sel |= BME280_OSR_HUM_SEL;
	settings_sel |= BME280_STANDBY_SEL;
	settings_sel |= BME280_FILTER_SEL;
	rslt = bme280_set_sensor_settings(settings_sel, dev);
	rslt = bme280_set_sensor_mode(BME280_NORMAL_MODE, dev);

	printf("Temperature, Pressure, Humidity\r\n");
	while (1) {
		/* Delay while the sensor completes a measurement */
		dev->delay_ms(70);
		rslt = bme280_get_sensor_data(BME280_ALL, &comp_data, dev);
		print_sensor_data(&comp_data);
	}

	return rslt;
}

void print_sensor_data(struct bme280_data *comp_data)
{
#ifdef BME280_FLOAT_ENABLE
        //printf("%0.2f, %0.2f, %0.2f\r\n",comp_data->temperature, comp_data->pressure, comp_data->humidity);
        Temp_bme280 = (uint8_t)(comp_data->temperature);
        Hum_bme280 = (uint8_t)(comp_data->humidity);
#else
        printf("%ld, %ld, %ld\r\n",comp_data->temperature, comp_data->pressure, comp_data->humidity);
#endif
}

/*!
 *  @brief This API is the entry point.
 *  It reads the chip-id and calibration data from the sensor.
 */
int8_t bme280_init(struct bme280_dev *dev)
{
    int8_t rslt;

    /* chip id read try count */
    uint8_t try_count = 5;
    uint8_t chip_id = 0;

    /* Check for null pointer in the device structure*/
    rslt = null_ptr_check(dev);

    /* Proceed if null check is fine */
    if (rslt == BME280_OK)
    {
        while (try_count)
        {
            /* Read the chip-id of bme280 sensor */
            rslt = bme280_get_regs(BME280_CHIP_ID_ADDR, &chip_id, 1, dev);

            /* Check for chip id validity */
            if ((rslt == BME280_OK) && (chip_id == BME280_CHIP_ID))
            {
                dev->chip_id = chip_id;

                /* Reset the sensor */
                rslt = bme280_soft_reset(dev);
                if (rslt == BME280_OK)
                {
                    /* Read the calibration data */
                    rslt = get_calib_data(dev);
                }
                break;
            }

            /* Wait for 1 ms */
            dev->delay_ms(1);
            --try_count;
        }

        /* Chip id check failed */
        if (!try_count)
        {
            rslt = BME280_E_DEV_NOT_FOUND;
        }
    }

    return rslt;
}

/*!
 * @brief This API reads the data from the given register address of the sensor.
 */
int8_t bme280_get_regs(uint8_t reg_addr, uint8_t *reg_data, uint16_t len, const struct bme280_dev *dev)
{
    int8_t rslt;

    /* Check for null pointer in the device structure*/
    rslt = null_ptr_check(dev);

